

#define h_一页大小 (4096)
#define h_虚拟地址起点 (0xC0000000)

#define h_内核目录_实地址 (16 * 1024 * 1024)
#define h_目录大小 h_一页大小

#define h_gdt_实地址 (h_内核目录_实地址 + h_目录大小)

#define gdt_大小 (2 * h_一页大小)

#define h_内核页表_起点 h_gdt_实地址 + gdt_大小

#define h_内核页表个数 (20 * 1024 * 1024 / 4096 / 1024)

#define h_内核全部页表个数 (1000 * 1024 * 1024 / 4096 / 1024)

// 20M以上的区域,为没用过的地方
//#define h_物理地址空白区 (20 * 1024 * 1024)
#define h_物理地址空白区 (h_内核页表_起点 + h_内核全部页表个数 * h_一页大小)

#define h_内核堆栈起点 (h_虚拟地址起点 + 500 * 1024 * 1024)
#define h_内核栈顶点 (h_虚拟地址起点 + 900 * 1024 * 1024 - 1)

#define h_内核目录_地址 (h_内核目录_实地址 + h_虚拟地址起点)
